wintersmith/contents/articles/Network/2015-07-19-mtu.html
---
date: 2015-07-19 00:27:44
template: tech.jade
title: MTU
category: Network
chage_frequency: monthly
tag: network,tcp
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">MTU</a></li>
<li><a href="#sec-2">IP 分片</a></li>
<li><a href="#sec-3">PMTUD</a>
<ul>
<li><a href="#sec-3-1">PMTUD的不足</a></li>
</ul>
</li>
<li><a href="#sec-4">PLPMTUD</a></li>
<li><a href="#sec-5">MSS</a></li>
<li><a href="#sec-6">Reference</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">MTU</h2>
<div class="outline-text-2" id="text-1">
<p>
MTU（最大传输单元）指的网络能够支持的最大IP报文的的长度。也是链路层的一项属性。
</p>

<p>
下面是各种链路层的MTU值：
</p>
<table id="MTU" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">MTU</th>
<th scope="col" class="left">Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">65535</td>
<td class="left">Official maximum MTU</td>
</tr>

<tr>
<td class="right">65535</td>
<td class="left">Hyperchannel</td>
</tr>

<tr>
<td class="right">17914</td>
<td class="left">16Mb IBM Token Ring</td>
</tr>

<tr>
<td class="right">8166</td>
<td class="left">IEEE 802.4</td>
</tr>

<tr>
<td class="right">4464</td>
<td class="left">IEEE 802.5 (4Mb max)</td>
</tr>

<tr>
<td class="right">4352</td>
<td class="left">FDDI (Revised)</td>
</tr>

<tr>
<td class="right">2048</td>
<td class="left">Wideband Network</td>
</tr>

<tr>
<td class="right">2002</td>
<td class="left">IEEE 802.5 (4Mb recommended)</td>
</tr>

<tr>
<td class="right">1536</td>
<td class="left">Exp. Ethernet Nets</td>
</tr>

<tr>
<td class="right">1500</td>
<td class="left">Ethernet Networks</td>
</tr>

<tr>
<td class="right">1500</td>
<td class="left">Point-to-Point (default)</td>
</tr>

<tr>
<td class="right">1492</td>
<td class="left">IEEE 802.3</td>
</tr>

<tr>
<td class="right">1006</td>
<td class="left">SLIP</td>
</tr>

<tr>
<td class="right">1006</td>
<td class="left">ARPANET</td>
</tr>

<tr>
<td class="right">576</td>
<td class="left">X.25 Networks</td>
</tr>

<tr>
<td class="right">544</td>
<td class="left">DEC IP Portal</td>
</tr>

<tr>
<td class="right">512</td>
<td class="left">NETBIOS</td>
</tr>

<tr>
<td class="right">508</td>
<td class="left">IEEE 802/Source-Rt Bridge</td>
</tr>

<tr>
<td class="right">508</td>
<td class="left">ARCNET</td>
</tr>

<tr>
<td class="right">296</td>
<td class="left">Point-to-Point (low delay)</td>
</tr>

<tr>
<td class="right">68</td>
<td class="left">Official minimum MTU</td>
</tr>
</tbody>
</table>

<p>
以太网的MTU是1500，这是很多人都知道的。
</p>

<p>
通讯的主机间经过若干跳的路由连接，数据包在传输过程中经过了中间不同的链路层，MTU就存在不一样的情况，这时，有两种办法来解决MTU小于IP包的情况：
</p>
<ul class="org-ul">
<li>IP分片
</li>
<li>通知源主机调整IP报文的大小重传
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">IP 分片</h2>
<div class="outline-text-2" id="text-2">
<p>
IP分片是IP协议的一部分，通过在IP报文头部中的标记（flag）中指定，IP分片发生在网关发现无法完整单次传输报文的时候，报文被拆分为多个ip报文，然后再由目标主机的IP协议栈实现报文的重组（reassembly）。
</p>

<p>
注意，由于一条经过的的链路层可能有多种，所以ip可能分片后再分片，每个IP报文有一个Identity的标识来表明属于同一个IP报文。
</p>

<p>
IP分段对上层协议是透明的。但是IP分段会消耗性能，而且如果其中某段报文传输失败，则整个报文就无效。因此，尽量减少IP分段的使用。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">PMTUD</h2>
<div class="outline-text-2" id="text-3">
<p>
另一种方式为丢弃超过本网络MTU的报文，同时发送一个ICMP的报文（Packet Too Big），甚至可以在报文中指定本网络的MTU的值，来告知主机，你需要调整发送的报文的大小。
</p>

<p>
Router在实现IP协议的规范中，如果IP报文未标记为DF（don't fragement），那么就执行第二种策略（ICMP回应），否则就执行第一种策略（分片）。
</p>

<p>
为了减少分片，那么就需要发送方选择合适的报文大小来发送，即，不要超过传输路径上任何被支持的MTU的值。
</p>

<p>
这个过程，叫做 <b>Path-MTU-Discover</b>
    路径MTU发现，是解决上面提到的发送报文选择最佳尺寸的问题，其实现原理就是通过设置IP报文的flag标记为DF防止分片，然后观察是否收到ICMP响应，如果收到则：
</p>
<ul class="org-ul">
<li>若ICMP报文中包含了路由器的MTU值，则根据此值进行调整PMTU（Path-MTU）
</li>
<li>若ICMP报文中未包含此路由的MTU值（这种情况发生在Router支持的协议较老，没有支持MTU协商），那么需要采用别的策略来调整PMTU
这种路径MTU发现发生在IP层。在IP层之上，还有其它的路径MTU发现策略，如PLPMTUD。
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">PMTUD的不足</h3>
<div class="outline-text-3" id="text-3-1">
<p>
PMTUD依赖了ICMP通告，而ICMP报文在某些情况下并不能保证有效：
</p>
<ul class="org-ul">
<li>路由器处于性能（内存与cpu）以及安全（大报文flood）的考虑，不产生ICMP回应。这种情况一般较少
</li>
<li>ICMP报文在到达发送方的途中被截获或者黑洞（如防火墙）。这种情况较常见。
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">PLPMTUD</h2>
<div class="outline-text-2" id="text-4">
<p>
PLPMTUD（Packetization-Layer-Path-MTU-Discover) 是在封包层次进行的MTU发现实现。基本思想是通过 <code>probe</code> 的方式来进行探测链路上面的MTU值。
</p>

<p>
实现方式可以实现在：tcp协议或者应用层协议等。
</p>

<p>
在TCP协议中实现的PLPMTUD，是通过从一个很小的tcp包开始逐渐发送probe，若success则增加probe的大小，直到可以判断出lose后则停止。在Linux系统中，我们可以通过设置如下：
</p>
<div class="org-src-container">

<pre class="src src-sh">/proc/sys/net/ipv4/tcp_mtu_probing
</pre>
</div>
<pre class="example">
tcp_mtu_probing (integer; default: 0; since Linux 2.6.17)
This parameter controls TCP Packetization-Layer Path MTU Discovery.
The following values may be  assigned  to the file:

    0  Disabled

    1  Disabled by default, enabled when an ICMP black hole detected

    2  Always enabled, use initial MSS of tcp_base_mss.
</pre>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">MSS</h2>
<div class="outline-text-2" id="text-5">
<p>
MSS （Max-Segment-Size）是TCP协议层的一个参数，在TCP握手的阶段，报文中的MSS表示了本端能够处理的最大段大小。如果超过这个值，报文可能会无法被处理。一般来说这个值是PMTU减去tcp+ip的header后的值：
</p>
<blockquote>
<p>
MSS = PMTU - IP-Header(20) - Tcp-Header(20)
</p>
</blockquote>
<p>
如果MTU是1500，那么MSS就是1460。
</p>

<p>
协议的双方应该遵循对方的MSS的建议，选择不要超过此MSS的TCP数据段大小进行发送，也就是说取MTU和MSS的最小作为合适的报文大小。
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Reference</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="http://www.cisco.com/c/en/us/support/docs/ip/generic-routing-encapsulation-gre/25885-pmtud-ipfrag.html">Resolve IP Fragmentation, MTU, MSS, and PMTUD Issues with GRE and IPSEC</a>
</li>
<li>PMTUD - <a href="http://www.ietf.org/rfc/rfc1191.txt">RFC1191</a>
</li>
<li>PLPMTUD - <a href="http://www.ietf.org/rfc/rfc4821.txt">RFC4821</a>
</li>
</ul>
</div>
</div>
